{"education":[{"institution":"University of Rochester","location":"Rochester, New York","area":"Brain and Cognitive Sciences","studyType":"Doctor of Philosophy","startDate":"2021"},{"institution":"Indian Institute of Technology, Kanpur","location":"Kanpur, India","area":"Cognitive Science","score":"9.35/10","studyType":"Master of Science by Research","startDate":"2018","endDate":"2021"},{"institution":"Amrita University","location":"Coimbatore, India","area":"Physics","score":"9.66/10","studyType":"Bachelor of Science","startDate":"2015","endDate":"2018"}],"projects":[{"name":"Experimental emergence of conventions in humans","summary":"Studying the emergence of conventions in the laboratory under various conditions through computerized multiplayer tasks with humans to address questions that promise to yield significant advances for our understanding of how groups solve recurring multi-agent coordination problems","startDate":"2021"},{"name":"Coordinated problem solving in marmoset monkeys <i> (Callithrix jacchus) </i>","summary":"Developing a paradigm to study the cognitive mechanisms underlying coordinated problem-solving by using deep learning and machine vision tools to track and quantify visual attention in free-moving common marmosets ","startDate":"2021","url":"https://github.com/oviya-mohan/3Dmarmogaze"},{"name":"Gaze following in marmoset monkeys <i> (Callithrix jacchus) </i>","summary":"Studying gaze-following (directing one’s attention to where someone else is looking, essential  for successful social interaction involving coordination)  in common marmoset monkeys (Callithrix jacchus) to address open questions about the evolution of this ability in humans using naturalistic video stimuli and high-precision eye tracking","startDate":"2021"},{"name":"Master's Thesis: Exectuive Function and Reasoning","summary":"Designed and conducted experiments, using rules of formal logic, to understand the connection between executive functions and reasoning in different developmental stages, including school children ","startDate":"2019","endDate":"2021"},{"name":"Master's Project: Agent-Based Modeling of Cooperation","summary":"Used an agent-based model to better understand the role of cooperation in the survival of both individuals and groups in a community","startDate":"2019","endDate":"2019"},{"name":"Bachelor's Project: Pulse Generating Circuit for NMR (for an indigenous MRI","summary":"Built a pulse generating circuit for NMR using 555 timer IC for building an indigenous MRI machine","startDate":"2018","endDate":"2018"}],"work":[{"name":"Applied Dynamics and Vibration Laboratory","position":"Research Associate","institution":"Indian Institute of Technology, Kanpur","location":"Kanpur, India","startDate":"2021","endDate":"2021","summary":"Designed an intuitive GUI to display data from a gas pipeline health monitoring robot (PHMR), for a project commissioned by the Gas Authority of India Ltd. (GAIL)."},{"name":"Role of Object's Self Relevance in Attentional Guidance","position":"Research Assistant","institution":"Indian Institute of Technology, Kanpur","location":"Kanpur, India","startDate":"2018","endDate":"2019","summary":"Designed and conducted behavioral experiments to understand the role of an object’s self-relevance when used as a distractor in visual search paradigms."},{"name":"Tribological Characterization and Coating Deposition","position":"Research Intern","institution":"Defence Research & Development Organization","location":"Hyderabad, India","startDate":"2017","endDate":"2017","summary":"Utilized a tribometer to characterize frictional properties of various coatings"}],"awards":[{"title":"Diverse Intelligences Summer Institute Fellow","date":"July 2025","awarder":"Templeton World Charity Foundation ","url":"disi.org","summary":"Vibrant network of early-career scholars who are devoted to bold, transdisciplinary inquiry into the origins, nature, and future of intelligences."},{"title":"Kuczaj Memorial Travel Grant","date":"March 2025","awarder":"National Marine Mammal Foundation","url":"https://nmmf.org/stan-kuczaj-fund/","summary":"Awarded  to students attending the Conference on Comparative Cognition (CO3), administered in memory of Dr. Stan Kuczaj, who was a leader in the study of comparative animal cognition, and believed in pursuing challenging topics in human and animal cognition with rigor, candor, and the spirit of intellectual adventure."},{"title":"Donald M. and Janet C. Barnard Fellowship","startDate":"September 2024","endDate":"May 2025","awarder":"University of Rochester","url":"https://x.com/UoR_BrainCogSci/status/1777765925762326546","summary":"Awarded by the School of Arts, Sciences & Engineering in recognition of achievements in research, mentoring, outreach, and service"},{"title":"Best Research Talk","date":"October 2023","awarder":"University of Rochester","url":"https://x.com/UoR_BrainCogSci/status/1716535439585149344","summary":"Best Talk at Gradaute Research Day"}]}